[Timeout] BlockStatement
src/dashboards/controllers/update.controller.ts:53:5
   public async update(
     @Param() params: UpdateDashboardParams,
     @Body() updateDashboardDto: UpdateDashboardDto,
-  ) {
-    const dashboard = await this.dashboardsService.update({
-      ...updateDashboardDto,
-      ...params,
-    });
-
-    if (dashboard === undefined) {
-      throw new NotFoundException();
-    }
-
-    return dashboard;
-  }
+  ) {}
 }
 

[Timeout] ConditionalExpression
src/dashboards/controllers/update.controller.ts:59:9
       ...params,
     });
 
-    if (dashboard === undefined) {
+    if (true) {
       throw new NotFoundException();
     }

[Timeout] EqualityOperator
src/dashboards/controllers/update.controller.ts:59:9
       ...params,
     });
 
-    if (dashboard === undefined) {
+    if (dashboard !== undefined) {
       throw new NotFoundException();
     }
