[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:11:48
   private readonly logger = new Logger(DashboardsService.name);
   private dashboards: Dashboard[] = [];
 
-  public async create(name: Dashboard["name"]) {
-    this.logger.log("Creating dashboard...");
-
-    try {
-      const dashboard = this.createDashboard(name);
-
-      this.dashboards = [...this.dashboards, dashboard];
-
-      this.logger.log(`Created dashboard ${dashboard.id}`);
-      this.logger.log(dashboard);
-
-      return dashboard;
-    } catch {
-      this.logger.warn("Failed to create dashboard");
-    }
-  }
+  public async create(name: Dashboard["name"]) {}
 
   public async list() {

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:14:9
   public async create(name: Dashboard["name"]) {
     this.logger.log("Creating dashboard...");
 
-    try {
-      const dashboard = this.createDashboard(name);
-
-      this.dashboards = [...this.dashboards, dashboard];
-
-      this.logger.log(`Created dashboard ${dashboard.id}`);
-      this.logger.log(dashboard);
-
-      return dashboard;
-    } catch {
+    try {} catch {
       this.logger.warn("Failed to create dashboard");
     }

[Timeout] StringLiteral
src/dashboards/dashboards.service.ts:19:23
 
       this.dashboards = [...this.dashboards, dashboard];
 
-      this.logger.log(`Created dashboard ${dashboard.id}`);
+      this.logger.log(``);
       this.logger.log(dashboard);
 

[NoCoverage] BlockStatement
src/dashboards/dashboards.service.ts:23:13
       this.logger.log(dashboard);
 
       return dashboard;
-    } catch {
-      this.logger.warn("Failed to create dashboard");
-    }
+    } catch {}
   }
 

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:28:23
     }
   }
 
-  public async list() {
-    this.logger.log("Finding all dashboards...");
-
-    try {
-      this.logger.log("Found all dashboards");
-      this.logger.log(this.dashboards);
-
-      return this.dashboards;
-    } catch {
-      this.logger.warn("Failed to find all dashboards");
-    }
-  }
+  public async list() {}
 
   public async read(id: Dashboard["id"]) {

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:31:9
   public async list() {
     this.logger.log("Finding all dashboards...");
 
-    try {
-      this.logger.log("Found all dashboards");
-      this.logger.log(this.dashboards);
-
-      return this.dashboards;
-    } catch {
+    try {} catch {
       this.logger.warn("Failed to find all dashboards");
     }

[NoCoverage] BlockStatement
src/dashboards/dashboards.service.ts:36:13
       this.logger.log(this.dashboards);
 
       return this.dashboards;
-    } catch {
-      this.logger.warn("Failed to find all dashboards");
-    }
+    } catch {}
   }
 

[NoCoverage] StringLiteral
src/dashboards/dashboards.service.ts:37:24
 
       return this.dashboards;
     } catch {
-      this.logger.warn("Failed to find all dashboards");
+      this.logger.warn("");
     }
   }

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:41:42
     }
   }
 
-  public async read(id: Dashboard["id"]) {
-    this.logger.log(`Finding dashboard ${id}...`);
-
-    try {
-      const dashboard = this.find(id);
-
-      this.logger.log(`Found dashboard ${id}`);
-      this.logger.log(dashboard);
-
-      return this.find(id);
-    } catch {
-      this.logger.warn(`Failed to find dashboard ${id}`);
-    }
-  }
+  public async read(id: Dashboard["id"]) {}
 
   public async update(dashboard: Dashboard) {

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:44:9
   public async read(id: Dashboard["id"]) {
     this.logger.log(`Finding dashboard ${id}...`);
 
-    try {
-      const dashboard = this.find(id);
-
-      this.logger.log(`Found dashboard ${id}`);
-      this.logger.log(dashboard);
-
-      return this.find(id);
-    } catch {
+    try {} catch {
       this.logger.warn(`Failed to find dashboard ${id}`);
     }

[NoCoverage] BlockStatement
src/dashboards/dashboards.service.ts:51:13
       this.logger.log(dashboard);
 
       return this.find(id);
-    } catch {
-      this.logger.warn(`Failed to find dashboard ${id}`);
-    }
+    } catch {}
   }
 

[NoCoverage] StringLiteral
src/dashboards/dashboards.service.ts:52:24
 
       return this.find(id);
     } catch {
-      this.logger.warn(`Failed to find dashboard ${id}`);
+      this.logger.warn(``);
     }
   }

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:56:45
     }
   }
 
-  public async update(dashboard: Dashboard) {
-    this.logger.log(`Updating dashboard ${dashboard.id}...`);
-
-    try {
-      this.dashboards = this.withUpdatedDashboard(dashboard);
-      const updatedDashboard = this.find(dashboard.id);
-
-      this.logger.log(`Updated dashboard ${dashboard.id}`);
-      this.logger.log(dashboard);
-
-      return updatedDashboard;
-    } catch {
-      this.logger.warn(`Failed to update dashboard ${dashboard.id}`);
-    }
-  }
+  public async update(dashboard: Dashboard) {}
 
   public async delete(id: Dashboard["id"]) {

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:59:9
   public async update(dashboard: Dashboard) {
     this.logger.log(`Updating dashboard ${dashboard.id}...`);
 
-    try {
-      this.dashboards = this.withUpdatedDashboard(dashboard);
-      const updatedDashboard = this.find(dashboard.id);
-
-      this.logger.log(`Updated dashboard ${dashboard.id}`);
-      this.logger.log(dashboard);
-
-      return updatedDashboard;
-    } catch {
+    try {} catch {
       this.logger.warn(`Failed to update dashboard ${dashboard.id}`);
     }

[NoCoverage] BlockStatement
src/dashboards/dashboards.service.ts:67:13
       this.logger.log(dashboard);
 
       return updatedDashboard;
-    } catch {
-      this.logger.warn(`Failed to update dashboard ${dashboard.id}`);
-    }
+    } catch {}
   }
 

[NoCoverage] StringLiteral
src/dashboards/dashboards.service.ts:68:24
 
       return updatedDashboard;
     } catch {
-      this.logger.warn(`Failed to update dashboard ${dashboard.id}`);
+      this.logger.warn(``);
     }
   }

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:72:44
     }
   }
 
-  public async delete(id: Dashboard["id"]) {
-    this.logger.log(`Deleting dashboard ${id}...`);
-
-    try {
-      const dashboard = this.find(id);
-      this.dashboards = this.withoutDashboard(dashboard);
-
-      this.logger.log(`Deleted dashboard ${id}`);
-
-      return dashboard;
-    } catch {
-      this.logger.warn(`Failed to delete dashboard ${id}`);
-    }
-  }
+  public async delete(id: Dashboard["id"]) {}
 
   private createDashboard(name: Dashboard["name"]): Dashboard {

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:75:9
   public async delete(id: Dashboard["id"]) {
     this.logger.log(`Deleting dashboard ${id}...`);
 
-    try {
-      const dashboard = this.find(id);
-      this.dashboards = this.withoutDashboard(dashboard);
-
-      this.logger.log(`Deleted dashboard ${id}`);
-
-      return dashboard;
-    } catch {
+    try {} catch {
       this.logger.warn(`Failed to delete dashboard ${id}`);
     }

[Timeout] StringLiteral
src/dashboards/dashboards.service.ts:79:23
       const dashboard = this.find(id);
       this.dashboards = this.withoutDashboard(dashboard);
 
-      this.logger.log(`Deleted dashboard ${id}`);
+      this.logger.log(``);
 
       return dashboard;

[Timeout] BlockStatement
src/dashboards/dashboards.service.ts:82:13
       this.logger.log(`Deleted dashboard ${id}`);
 
       return dashboard;
-    } catch {
-      this.logger.warn(`Failed to delete dashboard ${id}`);
-    }
+    } catch {}
   }
 

[Timeout] ConditionalExpression
src/dashboards/dashboards.service.ts:100:40
   }
 
   private withUpdatedDashboard(dashboard: Dashboard) {
-    return this.dashboards.map((d) => (d.id !== dashboard.id ? d : dashboard));
+    return this.dashboards.map((d) => (false ? d : dashboard));
   }
 

[Timeout] ArrowFunction
src/dashboards/dashboards.service.ts:100:32
   }
 
   private withUpdatedDashboard(dashboard: Dashboard) {
-    return this.dashboards.map((d) => (d.id !== dashboard.id ? d : dashboard));
+    return this.dashboards.map(() => undefined);
   }
 

[Timeout] MethodExpression
src/dashboards/dashboards.service.ts:104:12
   }
 
   private withoutDashboard(dashboard: Dashboard) {
-    return this.dashboards.filter((d) => d.id !== dashboard.id);
+    return this.dashboards;
   }
 

[Timeout] ConditionalExpression
src/dashboards/dashboards.service.ts:104:42
   }
 
   private withoutDashboard(dashboard: Dashboard) {
-    return this.dashboards.filter((d) => d.id !== dashboard.id);
+    return this.dashboards.filter((d) => false);
   }
 

[Killed] EqualityOperator
src/dashboards/dashboards.service.ts:108:40
   }
 
   private find(id: Dashboard["id"]) {
-    return this.dashboards.find((d) => d.id === id);
+    return this.dashboards.find((d) => d.id !== id);
   }
 }
killedBy: DashboardsModule GET /dashboards/{dashboardId} HTTP/1.1 returns dashboard on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Timeout] ConditionalExpression
src/dashboards/dashboards.service.ts:108:40
   }
 
   private find(id: Dashboard["id"]) {
-    return this.dashboards.find((d) => d.id === id);
+    return this.dashboards.find((d) => true);
   }
 }
