[Timeout] BlockStatement
src/dashboards/controllers/delete.controller.ts:35:63
 
   @HttpCode(204)
   @Delete(":id")
-  public async delete(@Param() params: DeleteDashboardParams) {
-    const dashboard = await this.dashboardsService.delete(params.id);
-
-    if (dashboard === undefined) {
-      throw new NotFoundException();
-    }
-  }
+  public async delete(@Param() params: DeleteDashboardParams) {}
 }
 

[Timeout] BlockStatement
src/dashboards/controllers/delete.controller.ts:38:34
   public async delete(@Param() params: DeleteDashboardParams) {
     const dashboard = await this.dashboardsService.delete(params.id);
 
-    if (dashboard === undefined) {
-      throw new NotFoundException();
-    }
+    if (dashboard === undefined) {}
   }
 }
