[Timeout] BlockStatement
src/dashboards/controllers/create.controller.ts:40:71
   constructor(private readonly dashboardsService: DashboardsService) {}
 
   @Post()
-  public async create(@Body() createDashboardDto: CreateDashboardDto) {
-    return this.dashboardsService.create(createDashboardDto.name);
-  }
+  public async create(@Body() createDashboardDto: CreateDashboardDto) {}
 }
 
