[Timeout] BlockStatement
src/dashboards/controllers/read.controller.ts:36:59
   constructor(private readonly dashboardsService: DashboardsService) {}
 
   @Get(":id")
-  public async read(@Param() params: ReadDashboardParams) {
-    const dashboard = await this.dashboardsService.read(params.id);
-
-    if (dashboard === undefined) {
-      throw new NotFoundException();
-    }
-
-    return dashboard;
-  }
+  public async read(@Param() params: ReadDashboardParams) {}
 }
 
