[Timeout] BlockStatement
src/dashboards/controllers/list.controller.ts:42:23
   constructor(private readonly dashboardsService: DashboardsService) {}
 
   @Get()
-  public async list() {
-    return this.dashboardsService.list();
-  }
+  public async list() {}
 }
 
