[NoCoverage] BlockStatement
src/main.ts:37:62
  *
  * @internal
  */
-const bootstrapValidation = (app: NestFastifyApplication) => {
-  app.useGlobalPipes(
-    // enables automatic validation of payloads
-    new ValidationPipe({
-      // enables automatic transformation of payloads
-      transform: true,
-    }),
-  );
-};
+const bootstrapValidation = (app: NestFastifyApplication) => {};
 
 /**

[NoCoverage] BooleanLiteral
src/main.ts:42:18
     // enables automatic validation of payloads
     new ValidationPipe({
       // enables automatic transformation of payloads
-      transform: true,
+      transform: false,
     }),
   );

[NoCoverage] BlockStatement
src/main.ts:61:56
  *
  * @internal
  */
-const bootstrapDocs = (app: NestFastifyApplication) => {
-  const config = new DocumentBuilder()
-    .setTitle("IoT Application Core")
-    .setDescription("Core API documentation")
-    .setVersion("1.0")
-    .addTag("dashboards")
-    .build();
-  const document = SwaggerModule.createDocument(app, config);
-  SwaggerModule.setup("/docs", app, document);
-};
+const bootstrapDocs = (app: NestFastifyApplication) => {};
 
 /**

[NoCoverage] StringLiteral
src/main.ts:64:21
 const bootstrapDocs = (app: NestFastifyApplication) => {
   const config = new DocumentBuilder()
     .setTitle("IoT Application Core")
-    .setDescription("Core API documentation")
+    .setDescription("")
     .setVersion("1.0")
     .addTag("dashboards")

[NoCoverage] StringLiteral
src/main.ts:65:17
   const config = new DocumentBuilder()
     .setTitle("IoT Application Core")
     .setDescription("Core API documentation")
-    .setVersion("1.0")
+    .setVersion("")
     .addTag("dashboards")
     .build();

[NoCoverage] StringLiteral
src/main.ts:69:23
     .addTag("dashboards")
     .build();
   const document = SwaggerModule.createDocument(app, config);
-  SwaggerModule.setup("/docs", app, document);
+  SwaggerModule.setup("", app, document);
 };
 

[NoCoverage] BlockStatement
src/main.ts:89:31
  *
  * @internal
  */
-const bootstrap = async () => {
-  /** NestJS application */
-  const app = await NestFactory.create<NestFastifyApplication>(
-    AppModule,
-    new FastifyAdapter(),
-  );
-
-  bootstrapValidation(app);
-  bootstrapDocs(app);
-
-  await app.listen(3000);
-  console.log(`Application is running on: ${await app.getUrl()}`);
-};
+const bootstrap = async () => {};
 
 bootstrap();

[NoCoverage] StringLiteral
src/main.ts:100:15
   bootstrapDocs(app);
 
   await app.listen(3000);
-  console.log(`Application is running on: ${await app.getUrl()}`);
+  console.log(``);
 };
 
