[NoCoverage] BlockStatement
src/repl.ts:19:28
  *
  * @internal
  */
-async function bootstrap() {
-  const replServer = await repl(AppModule);
-
-  // enables persistence of REPL commands
-  replServer.setupHistory(".nestjs_repl_history", (err) => {
-    if (err) {
-      console.error(err);
-    }
-  });
-}
+async function bootstrap() {}
 
 bootstrap();

[NoCoverage] BlockStatement
src/repl.ts:23:60
   const replServer = await repl(AppModule);
 
   // enables persistence of REPL commands
-  replServer.setupHistory(".nestjs_repl_history", (err) => {
-    if (err) {
-      console.error(err);
-    }
-  });
+  replServer.setupHistory(".nestjs_repl_history", (err) => {});
 }
 

[NoCoverage] ConditionalExpression
src/repl.ts:24:9
 
   // enables persistence of REPL commands
   replServer.setupHistory(".nestjs_repl_history", (err) => {
-    if (err) {
+    if (true) {
       console.error(err);
     }

[NoCoverage] BlockStatement
src/repl.ts:24:14
 
   // enables persistence of REPL commands
   replServer.setupHistory(".nestjs_repl_history", (err) => {
-    if (err) {
-      console.error(err);
-    }
+    if (err) {}
   });
 }
